	var index_t=0
	var myChart8
	var provinceArr = ["北京市", "天津市", "上海市", "重庆市", "新疆维吾尔自治区", "西藏自治区", "宁夏回族自治区", "内蒙古自治区",
                        "广西壮族自治区", "黑龙江省", "吉林省", "辽宁省", "河北省", "山东省", "江苏省", "安徽省",
                        "浙江省", "福建省", "广东省", "海南省", "云南省", "贵州省", "四川省", "湖南省",
                        "湖北省", "河南省", "山西省", "陕西省", "甘肃省", "青海省", "江西省", "台湾省", "香港特别行政区", "澳门特别行政区"];
	function initMapPage(){
		//定义全局变量，获取ajax中的数据

		var geoCoordMap = {
		    "3县": [116.44, 40.08],
		    "东城区": [116.44, 40.08],
		    "西城区": [116.44, 40.08],
		    "崇文区": [116.44, 40.08],
		    "宣武区": [116.44, 40.08],
		    "朝阳区": [116.44, 40.08],
		    "丰台区": [118.87, 42.28],
		    "石景山区": [116.44, 40.08],
		    "海淀区": [116.44, 40.08],
		    "门头沟区": [116.44, 40.08],
		    "房山区": [116.44, 40.08],
		    "通州区": [116.44, 40.08],
		    "顺义区": [116.44, 40.08],
		    "昌平区": [116.44, 40.08],
		    "大兴区": [116.44, 40.08],
		    "怀柔区": [116.44, 40.08],
		    "平谷区": [116.44, 40.08],
		    "密云县": [116.44, 40.08],
		    "延庆县": [116.44, 40.08],
		    "石家庄市": [114.51, 38.04],
		    "唐山市": [118.17, 39.63],
		    "秦皇岛市": [119.58, 39.94],
		    "邯郸市": [114.49, 36.61],
		    "邢台市": [118.1, 24.46],
		    "保定市": [114.51, 37.0682],
		    "张家口市": [114.884091, 40.811901],
		    "承德市": [117.939152, 40.976204],
		    "沧州市": [116.857461, 38.310582],
		    "廊坊市": [116.704441, 39.523927],
		    "衡水市": [115.665993 , 37.735097],
		    "太原市": [112.549717, 37.87046],
		    "大同市": [121.979603, 39.627114],
		    "阳泉市": [113.295259, 40.09031],
		    "长治市": [113.113556, 36.191112],
		    "晋城市": [112.851274, 35.497553],
		    "朔州市": [112.433387, 39.331261],
		    "晋中市": [112.736465, 37.696495],
		    "运城市": [119.942327, 37.177017],
		    "忻州市": [111.003957, 35.022778],
		    "临汾市": [111.517973, 36.08415],
		    "吕梁市": [111.134335, 37.524366],
		    "乌兰察布市": [113.114543 , 41.034126],
		    "兴安盟": [122.070317, 46.076268],
		    "锡林郭勒盟": [116.090996, 43.944018],
		    "阿拉善盟": [105.706423, 38.844814],
		    "呼和浩特市": [111.748426, 40.842723],
		    "包头市": [109.840405, 40.658168],
		    "乌海市": [106.825563, 39.673734],
		    "赤峰市": [118.886856, 42.257817],
		    "通辽市": [122.263119, 43.617429],
		    "鄂尔多斯市": [109.99029, 39.817179],
		    "呼伦贝尔市": [119.758168, 49.215333],
		    "巴彦淖尔市": [107.416959 , 40.757402],
		    "沈阳市": [123.465009, 41.677287],
		    "大连市": [121.618622, 38.91459],
		    "鞍山市": [122.995632, 41.110626],
		    "抚顺市": [123.921109, 41.875956],
		    "本溪市": [123.770519, 41.297909],
		    "丹东市": [124.383044, 40.124296],
		    "锦州市": [121.135742, 41.119269],
		    "营口市": [122.235152, 40.667432],
		    "阜新市": [121.648962, 42.011796],
		    "辽阳市": [123.18152, 41.269402],
		    "盘锦市": [122.069571, 41.124484],
		    "铁岭市": [123.844279, 42.290585],
		    "朝阳市": [120.451176, 41.576758],
		    "葫芦岛市": [120.856394, 40.755572],
		    "长春市": [125.323628, 43.817001],
		    "吉林市": [126.55302, 43.843577],
		    "四平市": [124.370785, 43.170344],
		    "辽源市": [125.145349, 42.902692],
		    "通化市": [125.936501, 41.721177],
		    "白山市": [126.427839, 41.942505],
		    "松原市": [124.823608, 45.118243],
		    "白城市": [122.841114, 45.619026],
		    "延边朝鲜族自治州": [129.513228, 42.904823],
		    "绥化市": [126.99293, 46.637393],
		    "大兴安岭地区": [124.117811, 50.411047],
		    "黑河市": [127.499023, 50.249585],
		    "哈尔滨市": [126.535319, 45.803131],
		    "齐齐哈尔市": [123.95792, 47.342081],
		    "鸡西市": [130.975966, 45.300046],
		    "鹤岗市": [130.277487, 47.332085],
		    "双鸭山市": [131.157304, 46.643442],
		    "大庆市": [125.11272, 46.590734],
		    "伊春市": [128.899396, 47.724775],
		    "佳木斯市": [130.361634, 46.809606],
		    "七台河市": [131.015584, 45.771266],
		    "牡丹江市": [129.618602, 44.582962],
		    "黄浦区": [121.473658, 31.230378],
		    "卢湾区": [121.473658, 31.230378],
		    "徐汇区": [121.473658, 31.230378],
		    "长宁区": [121.473658, 31.230378],
		    "静安区": [121.473658, 31.230378],
		    "普陀区": [121.473658, 31.230378],
		    "闸北区": [121.473658, 31.230378],
		    "虹口区": [121.473658, 31.230378],
		    "杨浦区": [121.473658, 31.230378],
		    "闵行区": [121.473658, 31.230378],
		    "宝山区": [121.473658, 31.230378],
		    "嘉定区": [121.473658, 31.230378],
		    "浦东新区": [121.473658, 31.230378],
		    "金山区": [121.473658, 31.230378],
		    "松江区": [121.473658, 31.230378],
		    "青浦区": [121.473658, 31.230378],
		    "南汇区": [121.473658, 31.230378],
		    "奉贤区": [121.473658, 31.230378],
		    "崇明县": [121.473658, 31.230378],
		    "县": [121.473658, 31.230378],
		    "南京市": [118.796623, 32.059352],
		    "无锡市": [120.301663 , 31.574729],
		    "常州市": [119.946973, 31.772752],
		    "苏州市": [120.619585, 31.299379],
		    "南通市": [120.864608, 32.016212],
		    "连云港市": [119.178821, 34.600018],
		    "淮安市": [119.021265, 33.597506],
		    "盐城市": [120.139998, 33.377631],
		    "常州市": [119.946973, 31.772752],
		    "镇江市": [119.452753, 32.204402],
		    "泰州市": [119.915176, 32.484882],
		    "宿迁市": [118.275162, 33.963008],
		    "徐州市": [117.184811, 34.261792],
		    "杭州市": [120.209947, 30.245853],
		    "宁波市": [121.6216, 29.859515],
		    "温州市": [120.672111, 28.000575],
		    "嘉兴市": [120.750865,30.762653],
		    "湖州市": [120.102398, 30.867198],
		    "绍兴市": [120.582112, 29.997117],
		    "金华市": [119.649506, 29.089524],
		    "衢州市": [118.87263, 28.941708],
		    "舟山市": [122.106863, 30.016028],
		    "台州市": [121.428599, 28.661378],
		    "丽水市": [119.921786, 28.451993],
		    "合肥市": [117.227308, 31.82057],
		    "芜湖市": [118.376451, 31.326319],
		    "蚌埠市": [117.363228, 32.939667],
		    "淮南市": [117.018329, 32.647574],
		    "马鞍山市": [118.506502, 31.669611],
		    "淮北市": [116.794664, 33.971707],
		    "铜陵市": [117.816576, 30.929935],
		    "安庆市": [117.043551, 30.50883],
		    "黄山市": [118.317325, 29.709239],
		    "滁州市": [118.316264, 32.303627],
		    "阜阳市": [115.819729, 32.896969],
		    "宿州市": [116.984084, 33.633891],
		    "巢湖市": [117.8618, 31.598628],
		    "亳州市": [115.782939, 33.869338],
		    "池州市": [117.489157, 30.656037],
		    "宣城市": [118.757995, 30.945667],
		    "六安市": [116.507676, 31.752889],
		    "福州市": [119.296389, 26.074268],
		    "厦门市": [118.110221, 24.490474],
		    "莆田市": [119.007558, 25.431011],
		    "三明市": [117.635001, 26.265444],
		    "泉州市": [118.675847, 24.87435],
		    "漳州市": [117.661801, 24.510897],
		    "南平市": [118.178459, 26.635627],
		    "龙岩市": [117.01728, 25.075097],
		    "宁德市": [119.527082, 26.659241],
		    "南昌市": [115.857963, 28.683016],
		    "景德镇市": [117.214664, 29.29256],
		    "萍乡市": [113.852186, 27.622946],
		    "九江市": [115.992811, 29.712034],
		    "新余市": [114.930835, 27.810835],
		    "鹰潭市": [117.033838, 28.238638],
		    "赣州市": [114.940278, 25.85097],
		    "吉安市": [114.986373, 27.111699],
		    "宜春市": [114.391137, 27.8043],
		    "抚州市": [116.358351, 27.98385],
		    "上饶市": [117.971185, 28.44442],
		    "济南市": [117.120098, 36.6512],
		    "青岛市": [120.324447, 36.064594],
		    "淄博市": [118.047649 , 36.814939],
		    "枣庄市": [117.557964, 34.856424],
		    "东营市": [118.66471, 37.434564],
		    "烟台市": [121.391382, 37.539297],
		    "潍坊市": [119.107078, 36.70925],
		    "济宁市": [116.587245, 35.415393],
		    "泰安市": [117.129063, 36.194968],
		    "威海市": [122.116394, 37.509691],
		    "日照市": [119.461208, 35.428588],
		    "莱芜市": [117.677736, 36.214397],
		    "临沂市": [118.326443, 35.065282],
		    "德州市": [116.307428, 37.453968],
		    "聊城市": [115.980367, 36.456013],
		    "滨州市": [118.016974, 37.383542],
		    "荷泽市": [115.469381, 35.246531],
		    "驻马店市": [114.024736, 32.980169],
		    "郑州市": [113.823666, 34.753349],
		    "开封市": [114.341447, 34.797049],
		    "洛阳市": [112.434468, 34.663041],
		    "平顶山市": [113.307718, 33.735241],
		    "安阳市": [114.352482, 36.103442],
		    "鹤壁市": [114.295444, 35.748236],
		    "新乡市": [113.883991, 35.302616],
		    "焦作市": [113.238266, 35.23904],
		    "濮阳市": [115.041299, 35.768234],
		    "许昌市": [113.826063, 34.022956],
		    "漯河市": [114.026405, 33.575855],
		    "三门峡市": [111.194099, 34.777338],
		    "南阳市": [112.540918, 32.999082],
		    "商丘市": [115.650497, 34.437054],
		    "信阳市": [114.075031, 32.123274],
		    "周口市": [114.649653, 33.620357],
		    "十堰市": [110.798657, 32.629034],
		    "武汉市": [114.305215, 30.592935],
		    "黄石市": [115.077048, 30.220074],
		    "宜昌市": [111.286451, 30.69187],
		    "襄樊市": [112.144146, 32.042426],
		    "鄂州市": [114.890593, 30.396536],
		    "荆门市": [112.204251, 31.03542],
		    "孝感市": [113.926656, 30.926423],
		    "荆州市": [112.23813, 30.326857],
		    "黄冈市": [114.879365, 30.447711],
		    "咸宁市": [114.328963, 29.832798],
		    "随州市": [113.382477, 31.690187],
		    "恩施土家族苗族自治州": [109.48699, 30.283114],
		    "长沙市": [112.938888, 28.228272],
		    "株洲市": [113.151737, 27.835806],
		    "湘潭市": [112.944052, 27.82973],
		    "衡阳市": [112.607693, 26.900358],
		    "邵阳市": [111.46923, 27.237842],
		    "岳阳市": [113.132855, 29.37029],
		    "常德市": [111.691347, 29.040225],
		    "张家界市": [110.479921, 29.127401],
		    "益阳市": [112.355042, 28.570066],
		    "郴州市": [113.014718, 25.77051],
		    "永州市": [111.608019, 26.434516],
		    "怀化市": [109.97824, 27.550082],
		    "娄底市": [112.008497, 27.728136],
		    "湘西土家族苗族自治州": [109.738783, 28.311994],
		    "广州市": [113.264385, 23.129112],
		    "韶关市": [113.597313, 24.811094],
		    "深圳市": [114.085947, 22.547],
		    "珠海市": [113.553986, 22.224979],
		    "汕头市": [116.708463, 23.37102],
		    "佛山市": [113.122717, 23.028762],
		    "江门市": [113.094942, 22.590431],
		    "湛江市": [110.364977, 21.274898],
		    "茂名市": [110.919229, 21.659751],
		    "肇庆市": [112.472529, 23.051546],
		    "惠州市": [114.412599, 23.079404],
		    "梅州市": [116.117582, 24.299112],
		    "汕尾市": [115.364238, 22.774485],
		    "河源市": [114.697802, 23.746266],
		    "阳江市": [111.982697, 21.857415],
		    "清远市": [113.051227, 23.685022],
		    "东莞市": [113.746262, 23.046237],
		    "中山市": [113.382391, 22.521113],
		    "潮州市": [116.632301, 23.661701],
		    "揭阳市": [116.355733, 23.543778],
		    "云浮市": [112.044439, 22.929801],
		    "南宁市": [108.36637, 22.817746],
		    "柳州市": [109.411703, 24.314617],
		    "桂林市": [110.299121, 25.274215],
		    "梧州市": [111.297604, 23.474803],
		    "北海市": [109.119254, 21.473343],
		    "防城港市": [108.345478, 21.614631],
		    "钦州市": [108.624175, 21.967127],
		    "贵港市": [109.602146, 23.0936],
		    "玉林市": [110.180962, 22.653889],
		    "百色市": [106.616285, 23.897742],
		    "贺州市": [111.552057, 24.414141],
		    "河池市": [108.062106, 24.695899],
		    "来宾市": [109.229772, 23.733766],
		    "崇左市": [107.353926, 22.404108],
		    "河池市": [108.062106, 24.695899],
		    "海口市": [110.198286, 20.044412],
		    "三亚市": [109.508268, 18.247872],
		    "省直辖县级行政单位": [110.33119, 20.031971],
		    "市辖区": [106.550464, 29.563761],
		    "5县": [106.550464, 29.563761],
		    "成都市": [104.066143, 30.573095],
		    "自贡市": [104.773447, 29.352765],
		    "攀枝花市": [101.716008, 26.580446],
		    "泸州市": [105.443349, 28.889138],
		    "德阳市": [104.398651, 31.127991],
		    "绵阳市": [104.741722, 31.46402],
		    "广元市": [105.829757, 32.433668],
		    "遂宁市": [105.571331, 30.513311],
		    "内江市": [105.057987, 29.580148],
		    "乐山市": [103.761263, 29.582024],
		    "南充市": [106.082974, 30.795282],
		    "眉山市": [103.831788, 30.048318],
		    "宜宾市": [104.630825, 28.760189],
		    "广安市": [106.633369, 30.456398],
		    "达州市": [107.468023, 31.209572],
		    "雅安市": [103.001033, 29.987722],
		    "资阳市": [104.641917, 30.122211],
		    "阿坝藏族羌族自治州": [102.221375, 31.899792],
		    "甘孜藏族自治州": [101.963815, 30.050663],
		    "凉山彝族自治州": [102.258746, 27.886762],
		    "巴中市": [106.753669, 31.858809],
		    "广元市": [105.829757, 32.433668],
		    "贵阳市": [106.630153, 26.647661],
		    "六盘水市": [104.846743, 26.584643],
		    "遵义市": [106.937265, 27.706626],
		    "安顺市": [105.932188, 26.245544],
		    "铜仁地区": [109.195488, 27.724789],
		    "黔西南布依族苗族自治州": [104.897971, 25.08812],
		    "毕节地区": [105.286877, 27.302204],
		    "黔东南苗族侗族自治州": [107.977488, 26.583352],
		    "黔南布依族苗族自治州": [107.517156, 26.258219],
		    "昆明市": [102.833722, 24.881539],
		    "曲靖市": [103.797851, 25.501557],
		    "玉溪市": [102.543907, 24.350461],
		    "保山市": [99.167133, 25.111802],
		    "昭通市": [103.717216, 27.336999],
		    "丽江市": [100.233026, 26.872108],
		    "思茅市": [100.977165, 22.78691],
		    "临沧市": [100.08697, 23.886567],
		    "楚雄彝族自治州": [101.546046, 25.041988],
		    "红河哈尼族彝族自治州": [103.384182, 23.366775],
		    "文山壮族苗族自治州": [104.24401, 23.36951],
		    "西双版纳傣族自治州": [100.797941, 22.001724],
		    "大理白族自治州": [100.225668, 25.589449],
		    "德宏傣族景颇族自治州": [98.578363, 24.436694],
		    "怒江傈僳族自治州": [98.854304, 25.850949],
		    "迪庆藏族自治州": [99.706463, 27.826853],
		    "拉萨市": [91.171961, 29.653482],
		    "昌都地区": [97.181442, 31.138179],
		    "山南地区": [91.773134, 29.237137],
		    "日喀则地区": [88.885817, 29.26681],
		    "那曲地区": [92.051746, 31.478148],
		    "阿里地区": [80.105498, 32.503187],
		    "林芝地区": [94.36149, 29.649128],
		    "西安市": [108.939621, 34.343147],
		    "铜川市": [108.979608, 34.916582],
		    "宝鸡市": [107.14487, 34.369315],
		    "咸阳市": [108.705117, 34.333439],
		    "渭南市": [109.502882, 34.499381],
		    "延安市": [109.49081, 36.596537],
		    "汉中市": [107.028621, 33.077668],
		    "榆林市": [109.741193, 38.290162],
		    "安康市": [109.029273, 32.6903],
		    "商洛市": [109.918561, 33.872706],
		    "兰州市": [103.834249, 36.06081],
		    "嘉峪关市": [98.277304 , 39.786529],
		    "金昌市": [102.187888, 38.514238],
		    "白银市": [104.173606, 36.54568],
		    "天水市": [105.724998, 34.578529],
		    "武威市": [102.634697, 37.929996],
		    "张掖市": [100.455472, 38.932897],
		    "平凉市": [106.684691, 35.54279],
		    "酒泉市": [98.494352, 39.732819],
		    "庆阳市": [107.638372 , 35.734218],
		    "定西市": [104.626294, 35.579578],
		    "陇南市": [104.929379, 33.388598],
		    "临夏回族自治州": [103.212006, 35.599446],
		    "甘南藏族自治州": [102.911008, 34.986354],
		    "西宁市": [101.778112, 36.617042],
		    "海东地区": [102.106684, 36.496876],
		    "海北藏族自治州": [100.90106, 36.959435],
		    "黄南藏族自治州": [102.019988, 35.517744],
		    "海南藏族自治州": [100.619542, 36.280353],
		    "果洛藏族自治州": [108.062106, 24.695899],
		    "玉树藏族自治州": [100.242143, 34.4736],
		    "海西蒙古族藏族自治州": [97.370785, 37.374663],
		    "银川市": [106.230909, 38.487193],
		    "石嘴山市": [106.376173, 39.01333],
		    "吴忠市": [106.199409, 37.986165],
		    "固原市": [106.285241, 36.004561],
		    "中卫市": [105.189568, 37.514951],
		    "省直辖行政单位": [87.617733, 43.792818],
		    "乌鲁木齐市": [87.616842, 43.82539],
		    "克拉玛依市": [84.873946, 45.595886],
		    "吐鲁番地区": [89.187359, 42.951279],
		    "哈密地区": [93.51316, 42.833248],
		    "昌吉回族自治州": [87.304012, 44.014577],
		    "博尔塔拉蒙古自治州": [82.074778, 44.903402],
		    "巴音郭楞蒙古自治州": [86.150969, 41.768552],
		    "阿克苏地区": [80.265068, 41.170712],
		    "克孜勒苏柯尔克孜自治州": [76.172825, 39.713431],
		    "喀什地区": [75.989138, 39.467821],
		    "和田地区": [79.92533, 37.110687],
		    "伊犁哈萨克自治州": [81.317946, 43.92186],
		    "塔城地区": [82.985732, 46.746301],
		    "阿勒泰地区": [88.13963, 47.848393],
		    "4县": [117.201538, 39.085294],
		    "和平区": [117.201538, 39.085294],
		    "河东区": [117.201538, 39.085294],
		    "河西区": [117.201538, 39.085294],
		    "南开区": [117.201538, 39.085294],
		    "河北区": [117.201538, 39.085294],
		    "红桥区": [117.201538, 39.085294],
		    "塘沽区": [117.201538, 39.085294],
		    "汉沽区": [117.201538, 39.085294],
		    "大港区": [117.201538, 39.085294],
		    "东丽区": [117.201538, 39.085294],
		    "西青区": [117.201538, 39.085294],
		    "津南区": [117.201538, 39.085294],
		    "北辰区": [117.201538, 39.085294],
		    "武清区": [117.201538, 39.085294],
		    "宝坻区": [117.201538, 39.085294],
		    "宁河县": [117.201538, 39.085294],
		    "静海县": [117.201538, 39.085294],
		    "蓟县": [117.201538, 39.085294]
		};
			
        var _eventTag = "SjxxLeadStatis";//事件标签
        var _loadEffect = "whirling";//加载效果spin,bar,ring,whirling,dynamicLine,bubble'
        var _isShowLoading = false; //是否显示加载动画
        var _idPrefix = "echarts_sjxx_lead_"; //id前缀
        var _statis_theme="macarons";//显示主题 macarons,infographic,shine,world
        var _renderArr=[
            {
                id:"ggzd",
                chart: null,
                el: null,
                render:function(data,searchData){
                    var prekyfx = "";
                    if(data&&this.chart){
                        var dataAxis= new Array();
                        var dataseries=new Array();
                        var preWzfl = "";
                        var preWzflNum = 0;
                        for (var i = 0; i < data.length; i++) {
                            dataAxis.push({value:data[i].wznum,name:data[i].wzzwm})
                            if(preWzfl != data[i].wzfl){
                                if(preWzfl != "")
                                    dataseries.push({value: preWzflNum,name:preWzfl});
                                preWzflNum = parseInt(data[i].wznum);
                                preWzfl = data[i].wzfl;
                            }else{
                                preWzflNum += parseInt(data[i].wznum);
                            }
                        }
                        if(data.length > 0)
                            dataseries.push({value: preWzflNum,name:preWzfl});
                        var pieoption = {
                                title : {
                                    subtext : searchData.zqs.ggzd,
                                    x : 'left'
                                },
                                tooltip: {
                                    trigger: 'item',
                                    formatter: "{b}: {c} ({d}%)"
                                },
                                series: [
                                    {
                                        name:'类型',
                                        type:'pie',
                                        selectedMode: 'single',
                                        radius: [0, '39%'],

                                        label: {
                                            normal: {
                                                position: 'inner'
                                            }
                                        },
                                        labelLine: {
                                            normal: {
                                                show: false
                                            }
                                        },
                                        data:dataseries
                                    },
                                    {
                                        type:'pie',
                                        radius: ['40%', '55%'],
                                        label: {
                                            normal: {
                                                formatter: '{b}: {c}',
                                                borderWidth: 1,
                                                borderRadius: 4,
                                                rich: {
                                                    a: {
                                                        color: '#999',
                                                        lineHeight: 22,
                                                        align: 'center'
                                                    },
                                                    hr: {
                                                        borderColor: '#aaa',
                                                        width: '100%',
                                                        borderWidth: 0.5,
                                                        height: 0
                                                    },
                                                    b: {
                                                        fontSize: 16,
                                                        lineHeight: 33
                                                    },
                                                    per: {
                                                        color: '#eee',
                                                        backgroundColor: '#334455',//背景颜色
                                                        padding: [2, 4],
                                                        borderRadius: 2
                                                    }
                                                }
                                            }
                                        },
                                        data:dataAxis
                                    }
                                ]
                            };
                        this.chart.setOption(pieoption);
                        this.chart.hideLoading();
                        //点击事件
                        this.chart.on("click",function(){
                            //clickMenu('N040101','/researchproject/projectManage_list.html','项目列表',null,'');
                        });
                    }
                }
            },
        ]
        myChart8 = echarts.init(document.getElementById('map'));
        var getData=function(){
            for(var i=0; i<_renderArr.length; i++){
                var _render = _renderArr[i];
                var _el = _render.el = document.getElementById(_idPrefix+_render.id);
                if(_el){
                    _render.chart = echarts.init(_el,_statis_theme);
                    _render.eventTag = "."+ _eventTag+"-"+_render.id;
                    if(_isShowLoading){
                        _render.chart.showLoading({
                            effect:_loadEffect
                        });
                    }
                    $(window).off(_render.eventTag).on("resize"+_render.eventTag, (function(_cfg){return function(){// resize事件
                        if(!_cfg.chart||$(document).find(_cfg.chart.dom).length==0){//元素不存在，则不操作
                            return;
                        }
                        _cfg.chart.resize();
                    }})(_render));
                }
            }
            var base = new Base64();
            var currentTime = new Date();
            var date = new Date();
            var hash = base.encode(date.getTime()+"");
           //获取标本送检路线信息
           $.ajax({
               type:'post',
               url:"/ws/statistics/getWzxxBySfmc",
               cache: false,
               data: {"sfmc":provinceArr[index_t],"sign":hash},
               dataType:'json',
               success:function(datas){
                   if(datas){
                        var _searchData = datas['searchData'];
                        for(var i=0; i<_renderArr.length; i++){
                            var _render = _renderArr[i];
                            var _data = datas[_render.id];
                            var key  = CryptoJS.enc.Utf8.parse("matridx123456789"); // 16 bytes key for AES-128
                            var iv = CryptoJS.enc.Utf8.parse("matridx123456789");
                            var _data = datas[_render.id];

                            var decrypted_data = CryptoJS.AES.decrypt(_data, key, {
                                  iv: iv,
                                  mode: CryptoJS.mode.CBC, // 确保与加密时使用的模式相同
                                  padding: CryptoJS.pad.Pkcs7
                              });
                              var decrypted_searchData = CryptoJS.AES.decrypt(_searchData, key, {
                                iv: iv,
                                mode: CryptoJS.mode.CBC, // 确保与加密时使用的模式相同
                                padding: CryptoJS.pad.Pkcs7
                            });
                            _render.render(JSON.parse(decrypted_data.toString(CryptoJS.enc.Utf8)),JSON.parse(decrypted_searchData.toString(CryptoJS.enc.Utf8)));
                        }
                      // setTimeout(setTimeoutTjnr,10000)
                   }else{
                       //throw "loadClientStatis数据获取异常";
                   }
                   option8 = {
                       title: {
                           text: '',
                           left: 'center',
                           textStyle: {
                               color: '#fff'
                           }
                       },
                       legend: {
                           show: false,
                           orient: 'vertical',
                           top: 'bottom',
                           left: 'right',
                           data: ['检测地'],
                           textStyle: {
                               color: '#fff'
                           }
                       },
                       geo:[
                           {
                               map: 'china',
                               zoom: 1.2,
                               zlevel: 2,
                               label: {
                               show: true,
                                   color: '#eee'
                               },
                               itemStyle: {
                                   color: 'rgba(23, 89, 151, 0.35)', // 背景
                                   borderWidth: '1', // 边框宽度
                                   borderColor: '#5FD7FF' // 边框颜色
                               },
                               emphasis: {
                                   areaColor: '#195BB9',
                                   label: {
                                       show: true
                                   }
                               },

                           },
                           {
                               map: 'china',
                               zoom: 1.2,
                               zlevel: 1,
                               itemStyle: {
                               color: 'rgba(23, 89, 151, 0.1)', // 背景
                               borderWidth: '5', // 边框宽度
                               borderColor: 'RGBA(129, 222, 227, 0.3)', // 边框颜色
                               shadowColor: '#fff', // 外部阴影
                               shadowBlur: '10',
                               colorStops: [
                                   {
                                   offset: 0,
                                   color: 'black' // 0% 处的颜色
                                   },
                                   {
                                   offset: 1,
                                   color: 'blue' // 100% 处的颜色
                                   }
                               ]
                               }
                           }


                       ],
                       series: [{
                           name: '检测地',
                           type: 'map',
                           map: "china",
                           geoIndex: 0,
                           zoom: 1.2,
                           coordinateSystem: 'geo',
                           data: provinceArr,
                           showLegendSymbol: false, // 存在legend时显示
                           roam: true,
                       },]
                   };
                   myChart8.setOption(option8);
                   myChart8.hideLoading();
                    myChart8.dispatchAction({
                         type: 'geoSelect', //高亮
                         name: provinceArr[index_t].replace(/市|省|自治区|自治州|特区|县|回族自治区|壮族自治区|维吾尔自治区|特别行政区/, ''), //数据index,要显示的区域
                     })
                   for(var i=0;i<provinceArr.length;i++){
                        if(i==index_t){
                           continue;
                        }else{
                            myChart8.dispatchAction({
                              type: 'geoUnSelect', //高亮
                              name: provinceArr[i].replace(/市|省|自治区|自治州|特区|县|回族自治区|壮族自治区|维吾尔自治区|特别行政区/, ''), //数据index,要显示的区域
                           })
                        }

                   }

                   $("#gzdspan").html(provinceArr[index_t]+"检出物种Top10")
                   index_t++;
                   if(index_t>provinceArr.length-1){
                      index_t=0
                   }
                   setTimeout(getData,$("#tjsj").val()*1000)
               }
           });

        }
        getData()
	}

function Base64() {

    // private property
    _keyStr = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=";

    // public method for encoding
    this.encode = function (input) {
        var output = "";
        var chr1, chr2, chr3, enc1, enc2, enc3, enc4;
        var i = 0;
        input = _utf8_encode(input);
        while (i < input.length) {
            chr1 = input.charCodeAt(i++);
            chr2 = input.charCodeAt(i++);
            chr3 = input.charCodeAt(i++);
            enc1 = chr1 >> 2;
            enc2 = ((chr1 & 3) << 4) | (chr2 >> 4);
            enc3 = ((chr2 & 15) << 2) | (chr3 >> 6);
            enc4 = chr3 & 63;
            if (isNaN(chr2)) {
                enc3 = enc4 = 64;
            } else if (isNaN(chr3)) {
                enc4 = 64;
            }
            output = output +
            _keyStr.charAt(enc1) + _keyStr.charAt(enc2) +
            _keyStr.charAt(enc3) + _keyStr.charAt(enc4);
        }
        return output;
    }

    // public method for decoding
    this.decode = function (input) {
        var output = "";
        var chr1, chr2, chr3;
        var enc1, enc2, enc3, enc4;
        var i = 0;
        input = input.replace(/[^A-Za-z0-9\+\/\=]/g, "");
        while (i < input.length) {
            enc1 = _keyStr.indexOf(input.charAt(i++));
            enc2 = _keyStr.indexOf(input.charAt(i++));
            enc3 = _keyStr.indexOf(input.charAt(i++));
            enc4 = _keyStr.indexOf(input.charAt(i++));
            chr1 = (enc1 << 2) | (enc2 >> 4);
            chr2 = ((enc2 & 15) << 4) | (enc3 >> 2);
            chr3 = ((enc3 & 3) << 6) | enc4;
            output = output + String.fromCharCode(chr1);
            if (enc3 != 64) {
                output = output + String.fromCharCode(chr2);
            }
            if (enc4 != 64) {
                output = output + String.fromCharCode(chr3);
            }
        }
        output = _utf8_decode(output);
        return output;
    }

    // private method for UTF-8 encoding
    _utf8_encode = function (string) {
        string = string.replace(/\r\n/g,"\n");
        var utftext = "";
        for (var n = 0; n < string.length; n++) {
            var c = string.charCodeAt(n);
            if (c < 128) {
                utftext += String.fromCharCode(c);
            } else if((c > 127) && (c < 2048)) {
                utftext += String.fromCharCode((c >> 6) | 192);
                utftext += String.fromCharCode((c & 63) | 128);
            } else {
                utftext += String.fromCharCode((c >> 12) | 224);
                utftext += String.fromCharCode(((c >> 6) & 63) | 128);
                utftext += String.fromCharCode((c & 63) | 128);
            }

        }
        return utftext;
    }

    // private method for UTF-8 decoding
    _utf8_decode = function (utftext) {
        var string = "";
        var i = 0;
        var c = c1 = c2 = 0;
        while ( i < utftext.length ) {
            c = utftext.charCodeAt(i);
            if (c < 128) {
                string += String.fromCharCode(c);
                i++;
            } else if((c > 191) && (c < 224)) {
                c2 = utftext.charCodeAt(i+1);
                string += String.fromCharCode(((c & 31) << 6) | (c2 & 63));
                i += 2;
            } else {
                c2 = utftext.charCodeAt(i+1);
                c3 = utftext.charCodeAt(i+2);
                string += String.fromCharCode(((c & 15) << 12) | ((c2 & 63) << 6) | (c3 & 63));
                i += 3;
            }
        }
        return string;
    }
}
$(document).ready(function(){
	initMapPage();
});